Долома/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <predefined>
    <items>
      <name>Животное</name>
      <description>Животное</description>
    </items>
    <items>
      <name>Молоко</name>
      <description>Молоко</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Бык</name>
    <type>
      <types>CatalogRef.БыкиПлеменные</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСемени</name>
    <type>
      <types>EnumRef.ТипыСемени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКорма</name>
    <type>
      <types>EnumRef.ВидыКормов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКорма</name>
    <type>
      <types>CatalogRef.ГруппыКормов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Долома/src/InformationRegisters/ТаблицаПитательностиКормов/ТаблицаПитательностиКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаблицаПитательностиКормов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СухоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ОЭ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NEL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>XP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйСП</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НерастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>nXp</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>RNB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>UDP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЗ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЖ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СК</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NDF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Структ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрКл</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Крахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ТранзитныйКрахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Сахар</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Ca</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Na</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Mg</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>K</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Cl</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>S</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>P</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ПереваримоеОрганическоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НДКПпереваримость</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>УксуснаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>МолочнаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>pH</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Препарат</name>
  </enumValues>
  <enumValues>
    <name>Семя</name>
  </enumValues>
  <enumValues>
    <name>Корм</name>
  </enumValues>
  <enumValues>
    <name>ЗооТовары</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Catalogs/Номенклатура/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьФильтры = Истина; 
	КодФормы = "Справочник_Номенклатура_ФормаСписка";
	ПодборТоваровСервер.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры   

&НаКлиенте
Процедура ВидыНоменклатурыПриАктивизацииСтроки(Элемент)   
	
	ПодборТоваровКлиент.ПриАктивизацииСтрокиСпискаВидыНоменклатуры(ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ВидыНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатурыПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
	
	ПодборТоваровСервер.ПриИзмененииВидаНоменклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование И Не Группа Тогда
		
		Отказ = Истина;
		
		ПараметрыСозданияВФорму = Новый Структура("ВидНоменклатуры");
		
		Если ИспользоватьФильтры Тогда
			
			Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
				ПараметрыСозданияВФорму.ВидНоменклатуры = ВидНоменклатуры;
			КонецЕсли;
			
		КонецЕсли;
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", Новый Структура("ДополнительныеПараметры", ПараметрыСозданияВФорму), ЭтаФорма); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиФормыНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	ПодборТоваровСервер.СохранитьНастройкиФормы(ЭтаФорма);
	
КонецПроцедуры   

&НаКлиенте
Процедура ИспользоватьФильтрыПриИзменении(Элемент)
	
	ИспользоватьФильтрыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьФильтрыПриИзмененииНаСервере()
	
	ПодборТоваровСервер.ПриИзмененииИспользованияФильтров(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатураПриАктивизацииСтроки(Элемент)   
	
	ПодборТоваровКлиент.ПриАктивизацииСтрокиСпискаНоменклатуры(ЭтаФорма);
	ТекущиеДанные = Элементы.СписокНоменклатура.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Ссылка, "ТипНоменклатуры");
		Элементы.ФормаТаблицаПитательности.Доступность = ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Корм");
	Иначе
		Элементы.ФормаТаблицаПитательности.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ПодборТоваровКлиент.УстановитьТекущуюСтрокуИерархииНоменклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПитательности(Команда)
	
	ТекущиеДанные = Элементы.СписокНоменклатура.ТекущиеДанные;
	СтрОтбора = Новый Структура("Номенклатура", ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", СтрОтбора);
	ОткрытьФорму("РегистрСведений.ТаблицаПитательностиКормов.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры
